app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "provider", "uid") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", 2016-07-21 18:08:06 UTC], ["updated_at", 2016-07-21 18:08:06 UTC], ["provider", "facebook"], ["uid", "10157207096260113"]]
SELECT  "reigns".* FROM "reigns" ORDER BY "reigns"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "reigns" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", 2016-07-22 17:21:53 UTC], ["updated_at", 2016-07-22 17:21:53 UTC]]
UPDATE "reigns" SET "finished" = $1, "updated_at" = $2 WHERE "reigns"."id" = $3  [["finished", 2016-07-22 17:53:27 UTC], ["updated_at", 2016-07-22 17:53:27 UTC], ["id", 1]]
---
  def create
    if request.env['omniauth.auth']
      user = User.create_with_omniauth(request.env['omniauth.auth'])

      if current_reign
        previous_reign = Reign.last
        previous_reign.finished = DateTime.now
        previous_reign.save